Emacs.org
#+title: Emacs configuration
#+author: Philippe Gabriel

Below is a sectioned configuration of emacs. Each code blocks gets written out to the ~~/.emacs.d/init.el~ config file.

* Startup

** Performance Measurements

Here we reduce threshold for garbage collector to improve performanceand check for the startup time.

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  
  (setq gc-cons-threshold (* 50 1000 1000)) ; Sets garbage collection threshold high enough

#+end_src

** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-startup.el

  ;;; pg-startup.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

** Server Initialization

Starting a server for displaying polybar info

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-startup.el

  (server-start)

#+end_src

** Package Initialization

Some initializations are first set up.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-startup.el

  (unless (featurep 'straight)
    (defvar bootstrap-version)
    (let ((bootstrap-file
           (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
          (bootstrap-version 5))
      (unless (file-exists-p bootstrap-file)
        (with-current-buffer
            (url-retrieve-synchronously
             "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
             'silent 'inhibit-cookies)
          (goto-char (point-max))
          (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage)))

#+end_src

** Package | use-package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-startup.el

  (straight-use-package 'use-package)
  (require 'use-package)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-use-package"

#+end_src

** Startup package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-startup.el

  (provide 'pg-startup)

#+end_src

* Native Compilation

** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-native-compilation.el

  ;;; pg-native-compilation.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

** Native compilation settings

Some settings specific to the ~emacs-native-comp~ version of emacs

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-native-compilation.el

  (setq native-comp-async-report-warnings-errors nil) ; Silence compiler warnings
  (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory)) ; Set directory for cache storage

#+end_src

** Native compilation package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-native-compilation.el

  (provide 'pg-native-compilation)

#+end_src

* Packages

** Guix Management

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-guix.el

  ;;; pg-guix.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | guix

Emacs interface for guix package manager.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-guix.el

  (use-package guix
    :straight nil
    :init
    (require 'guix)
    :commands guix)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-guix"

#+end_src

*** Package | geiser

Scheme REPL.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-guix.el

  (use-package geiser
    :straight nil
    :init
    (require 'geiser)
    :after guix)
    ;; :bind
    ;; (:map geiser-repl-mode-map
    ;;       ("C-l" . geiser-repl-clear-buffer)))

#+end_src

*** System management package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-guix.el

  (provide 'pg-guix)

#+end_src

** Password Utilities

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  ;;; pg-passwords.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | auth-source

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (use-package auth-source
    :straight nil
    :init
    (require 'auth-source)
    :custom
    (auth-sources '("~/.authinfo.gpg")))

#+end_src

*** Package | epg-config

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (unless pg/is-termux
    (use-package epg-config
      :straight nil
      :init
      (require 'epg-config)
      :custom
      (epg-pinentry-mode 'loopback)))

#+end_src

*** Package | pinentry

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (unless pg/is-termux
    (use-package pinentry
      :straight t
      :init
      (require 'pinentry)
      :config
      (pinentry-start)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-pinentry"
  "pinentry-emacs"

#+end_src

*** Package | password-cache

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (use-package password-cache
    :straight nil
    :init
    (require 'password-cache)
    :custom
    (password-cache-expiry (* 60 60 2)))

#+end_src

*** Package | password-store

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (use-package password-store
    :straight t
    :init
    (require 'password-store)
    :custom
    (password-store-time-before-clipboard-restore 60))

#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-password-store"

#+end_src

*** Password lookup

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (defun pg/lookup-password (&rest keys)
    "Looks up passwords from `authinfo' entries."
    (let ((result (apply #'auth-source-search keys)))
      (if result
          (funcall (plist-get (car result) :secret))
        nil)))

#+end_src

*** Password utilities package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (provide 'pg-passwords)

#+end_src

** Keybind Log

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-keylog.el

  ;;; pg-keylog.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | keycast

Useful when starting out with the various keybindings and when presenting to an audience.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-keylog.el

  (define-minor-mode pg/keycast-mode
    "Show current command and its key binding in the mode line (fix for use with
        doom-mode-line)."
    :global t
    (interactive)
    (if pg/keycast-mode
        (add-hook 'pre-command-hook #'keycast--update t)
      (remove-hook 'pre-command-hook #'keycast--update)))

  (use-package keycast
    :straight t
    :init
    (require 'keycast)
    :custom
    (keycast-mode-line-format "%2s%k%c%2s")
    :config
    (fset #'keycast-mode #'pg/keycast-mode)
    (keycast-mode)
    (add-to-list 'global-mode-string '("" keycast-mode-line)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-keycast"

#+end_src

*** Keybind Log package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-keylog.el

  (provide 'pg-keylog)

#+end_src

** Command Completion Framework

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  ;;; pg-completion.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | savehist

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (use-package savehist
    :straight nil
    :init
    (require 'savehist)
    :config
    (savehist-mode))

#+end_src

*** Package | marginalia

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (use-package marginalia
    :straight t
    :init
    (require 'marginalia)
    :after vertico
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy
                             marginalia-annotators-light
                             nil))
    :config
    (marginalia-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-marginalia"

#+end_src

*** Package | consult

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (use-package consult
    :straight t
    :init
    (require 'consult)
    :bind
    ("C-s" . consult-line)
    ("C-x b" . consult-buffer)
    (:map minibuffer-local-map
          ("C-r" . consult-history)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-consult"

#+end_src

*** Package | orderless

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (use-package orderless
    :straight t
    :init
    (require 'orderless)
    :after vertico
    :custom
    (completion-styles '(orderless))
    (completion-category-defaults nil)
    (orderless-skip-highlighting nil)
    (completion-category-overrides '((file (styles basic partial-completion)))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-orderless"

#+end_src

*** Package | corfu

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (use-package corfu
    :straight t
    :init
    (require 'corfu)
    :custom
    (corfu-cycle t)
    :bind
    (:map corfu-map
          ("C-j" . corfu-next)
          ("C-k" . corfu-previous)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-corfu"

#+end_src

*** Package | vertico

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (use-package vertico
    :straight t
    :init
    (require 'vertico)
    :custom
    (vertico-cycle t)
    :bind
    (:map vertico-map
          ("C-j" . vertico-next)
          ("C-k" . vertico-previous))
    :config
    (vertico-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-vertico"

#+end_src

*** Package | embark

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (use-package embark
    :straight t
    :init
    (require 'embark)
    :custom
    (embark-confirm-act-all nil)
    :bind
    ("C-S-a" . embark-act)
    (:map minibuffer-local-map
          ("C-d" . embark-act))
    :config
    (setq embark-action-indicator
          (lambda (map)
            (which-key--show-keymap "Embark" map nil nil 'no-paging)
            #'which-key--hide-popup-ignore-command)
          embark-become-indicator embark-action-indicator))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-embark"

#+end_src

*** Package | embark-consult

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (use-package embark-consult
    :straight '(embark-consult :host github
                               :repo "oantolin/embark"
                               :files ("embark-consult.el"))
    :init
    (require 'embark-consult)
    :after (embark consult)
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))

#+end_src

*** Package | prescient

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (use-package prescient
    :straight t
    :init
    (require 'prescient))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-prescient"

#+end_src

*** Package | which-key

Displays additional keybindings subsequent to prefix keybindings

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (use-package which-key
    :straight t
    :init
    (require 'which-key)
    :after diminish
    :diminish which-key-mode
    :custom
    (which-key-idle-delay 1)
    :config
    (which-key-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-which-key"

#+end_src

*** Package | helm

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (defun pg/helm-lsp-java ()
    "Enables `helm' when `lsp-java' is running."
    (if (and (eq #'java-mode major-mode)
             (memq #'lsp-mode local-minor-modes))
        (helm-mode 1)
      (helm-mode 0)))

  (use-package helm
    :straight t
    :init
    (require 'helm)
    :after lsp-java
    :hook
    (java-mode . pg/helm-lsp-java)
    :bind
    (:map helm-map
          ("C-j" . helm-next-line)
          ("C-k" . helm-previous-line)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-helm"

#+end_src

*** Command completion framework package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (provide 'pg-completion)

#+end_src

** UI Enhancement

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  ;;; pg-ui.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** UI basic settings

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (setq inhibit-startup-message t  ; Disable startup message
        scroll-conservatively 1000 ; Slow scrolling
        split-width-threshold 185) ; Width for splitting
  (unless pg/is-termux
    (scroll-bar-mode 0)            ; Disable visible scrollbar
    (tool-bar-mode 0)              ; Disable toolbar
    (tooltip-mode 0))
  (menu-bar-mode 0)                ; Disable menu bar

  ;; Set frame transparency
  (unless (or pg/is-termux (not pg/exwm-enabled))
    (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
    (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
    (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
    (add-to-list 'default-frame-alist '(fullscreen . maximized)))

#+end_src

*** Package | diminish

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (use-package diminish
    :straight t
    :init
    (require 'diminish))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-diminish"

#+end_src

*** Package | all-the-icons

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (use-package all-the-icons
    :straight t
    :init
    (require 'all-the-icons))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-all-the-icons"

#+end_src

*** Package | doom-modeline

Customizes the look of the modeline for better aesthetic.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (use-package doom-modeline
    :straight t
    :init
    (require 'doom-modeline)
    :custom
    (doom-modeline-height 15)
    (doom-modeline-modal-icon nil)
    (doom-modeline-enable-word-count t)
    (doom-modeline-indent-info t)
    (doom-modeline-buffer-file-name-style 'truncate-except-project)
    (doom-modeline-mu4e t)
    :config
    (doom-modeline-mode 1))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-doom-modeline"

#+end_src

*** Package | autothemer

Important to disable current theme ~M-x disable-theme~ in order to experiment.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (use-package autothemer
    :straight t
    :init
    (require 'autothemer)
    :config
    (load-theme 'onedark-variant t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-autothemer"

#+end_src

