Emacs.org
*** Package | ligature

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-editing.el

  (use-package ligature
    :straight '(ligature :type git
                         :host github
                         :repo "mickeynp/ligature.el")
    :init
    (require 'ligature)
    :config
    (ligature-set-ligatures 't '("++" "--" "/=" "&&" "||" "||=" "->" "=>" "::" "__" "==" "===" "!=" "=/=" "!=="
                                 "<=" ">=" "<=>" "/*" "*/" "//" "///" "\\n" "\\\\" "<<" "<<<" "<<=" ">>" ">>>" ">>="
                                 "|=" "^=" "**" "?." "</" "<!--" "</>" "-->" "/>" "www" "##" "###" "####" "#####"
                                 "######" "--" "---" "----" "-----" "------" "====" "=====" "======" "[]" "<>" "<~>"
                                 "??" ".." "..." "=~" "!~" ":=" "..<" "!!" ":::" "=!=" "=:=" "<:<" "..=" "::<"
                                 "#{" "#(" "#_" "#_(" "#?" "#:" ".-" ";;" "~@" "<-" "#{}" "|>" "=>>" "=<<" ">=>" "<=<"
                                 "=>=" "=<=" "<$" "<$>" "$>" "<+" "<+>" "+>" "<*" "<*>" "*>" "<|>" ".=" "#=" "+++" "***"
                                 ":>:" ":<:" "<|||" "<||" "<|" "||>" "|||>" "[|" "|]" "~-" "~~" "%%" "/\\" "\\/" "-|" "_|"
                                 "_|_" "|-" "||-" ":>" ":<" ">:" "<:" "::>" "<::" ">::" "{|" "|}" "#[" "]#" "::="
                                 "#!" "#=" "->>" ">-" ">>-" "->-" "->>-" "=>>=" ">>->" ">>=>" "|->" "|=>" "~>" "~~>" "//=>"
                                 "<<-" "-<" "-<<" "-||" "-<-" "-<<-" "=<" "=|" "=||" "=<<=" "<-<<" "<=<<" "<-|" "<=|" "<~"
                                 "<~~" "<=//" "<->" "<<=>>" "|-|-|" "|=|=|" "/=/"))
    (global-ligature-mode 't))

#+end_src

*** Package | rainbow-delimiters

Colors matching delimiters with different colours for distinguishability.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-editing.el

  (use-package rainbow-delimiters
    :straight t
    :init
    (require 'rainbow-delimiters)
    :hook
    (prog-mode . rainbow-delimiters-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-rainbow-delimiters"

#+end_src

*** Package | abbrev-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-editing.el

  (use-package abbrev
    :straight nil
    :init
    (require 'abbrev)
    :after diminish
    :diminish abbrev-mode)

#+end_src

*** Package | highlight-indent-guides

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-editing.el

  (use-package highlight-indent-guides
    :straight t
    :init
    (require 'highlight-indent-guides)
    :hook
    (prog-mode . highlight-indent-guides-mode)
    :custom
    (highlight-indent-guides-responsive 'stack)
    (highlight-indent-guides-method 'character))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-highlight-indent-guides" ;; Old version 0.8.5

#+end_src

*** Package | smartparens

For surrounding delimiter matching and autocompletion.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-editing.el

  (use-package smartparens
    :straight t
    :init
    (require 'smartparens)
    :after diminish
    :diminish smartparens-mode
    :config
    (smartparens-global-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-smartparens"

#+end_src

*** Package | outshine

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-editing.el

  (use-package outshine
    :straight t
    :init
    (require 'outshine)
    :hook
    (prog-mode . outshine-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-outshine"

#+end_src

*** Package | selectric-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-editing.el

  (defun pg/selectric-type-sound ()
    "Make the sound of the printing element hitting the paper."
    (progn
      (selectric-make-sound (format "%sselectric-move.wav" selectric-files-path))
      (unless (minibufferp)
        (if (= (current-column) (current-fill-column))
            (selectric-make-sound (format "%sping.wav" selectric-files-path))))))

  (use-package selectric-mode
    :disabled
    :straight t
    :init
    (require 'selectric-mode)
    :init
    (fset #'selectric-type-sound #'pg/selectric-type-sound))

#+end_src

*** Package | rainbow-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-editing.el

  (use-package rainbow-mode
    :straight t
    :init
    (require 'rainbow-mode)
    :after diminish
    :diminish rainbow-mode
    :hook
    ((org-mode
      emacs-lisp-mode
      web-mode
      typescript-mode
      css-mode
      scss-mode
      less-css-mode) . rainbow-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-rainbow-mode"

#+end_src

*** Package | emojify

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-editing.el

  (use-package emojify
    :straight t
    :init
    (require 'emojify)
    :config
    (global-emojify-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-emojify"

#+end_src

*** Package | evil

Allows usage of vim-like keybindings for some modes in emacs.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-editing.el

  (defun pg/evil-hook()
    "Modes that should start in emacs mode"
    (dolist (mode '(custom-mode
                    eshell-mode
                    git-rebase-mode
                    erc-mode
                    circe-server-mode
                    circe-chat-mode
                    circe-query-mode
                    sauron-mode
                    term-mode))
      (add-to-list 'evil-emacs-state-modes mode)))

  (use-package evil
    :straight t
    :preface
    (customize-set-variable 'evil-want-keybinding nil)
    :init
    (require 'evil)
    :hook
    (evil-mode . pg/evil-hook)
    :custom
    (evil-want-integration t)
    (evil-want-C-u-scroll t)
    (evil-want-C-i-jump nil)
    (evil-want-Y-yank-to-eol t)
    (evil-want-fine-undo t)
    :bind
    (:map evil-insert-state-map
          ("C-g" . evil-normal-state))
    :config
    (evil-mode 1)
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
    (dolist (mode '(messages-buffer-mode
                    dashboard-mode))
      (evil-set-initial-state mode 'normal)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-evil"

#+end_src

*** Package | evil-collection

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-editing.el

  (use-package evil-collection
    :straight t
    :init
    (require 'evil-collection)
    :after (evil diminish)
    :diminish evil-collection-unimpaired-mode
    :config
    (evil-collection-init))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-evil-collection"

#+end_src

*** Editing experience package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-editing.el

  (provide 'pg-editing)

#+end_src

** Help Documentation

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-help.el

  ;;; pg-help.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | helpful

Displays full documentations in place of the default help function.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-help.el

  (use-package helpful
    :straight t
    :init
    (require 'helpful)
    :bind
    ([remap describe-function] . helpful-callable)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-key] . helpful-key))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-helpful"

#+end_src

*** Package | Info

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-help.el

  (defun pg/Info-mode-setup ()
    "Defining some behaviours for the major info-mode."
    (auto-fill-mode 0)
    (setq-local face-remapping-alist '((default (:height 1.5) default)
                                       (fixed-pitch (:height 1.5) fixed-pitch)
                                       (info-menu-header (:height 1.5) info-menu-header)
                                       (info-title-1 (:height 1.05) info-title-1)
                                       (info-title-2 (:height 1.15) info-title-2)
                                       (info-title-3 (:height 1.15) info-title-3)
                                       (info-title-4 (:height 2.0) info-title-4)))
    (set-face-attribute 'Info-quoted nil :foreground "orange" :inherit 'fixed-pitch)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package info
    :straight nil
    :init
    (require 'info)
    :hook
    (Info-mode-hook . pg/Info-mode-setup))

#+end_src

*** Package | visual-fill-column

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-help.el

  (defun pg/docs-visual-fill ()
    "Applies text soft wrap."
    (setq visual-fill-column-width 150
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :straight t
    :init
    (require 'visual-fill-column)
    :hook
    ((org-mode
      gfm-view-mode
      Info-mode
      eww-mode) . pg/docs-visual-fill))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-visual-fill-column"

#+end_src

*** Help documentation package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-help.el

  (provide 'pg-help)

#+end_src

** Web Design

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-web.el

  ;;; pg-web.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | eww

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-web.el

  (defun pg/eww-mode-setup ()
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq-local face-remapping-alist '((variable-pitch (:height 2.0) variable-pitch)
                                       (fixed-pitch (:height 2.0) fixed-pitch)
                                       (default (:height 2.0) default))))

  (use-package eww
    :straight nil
    :init
    (require 'eww)
    :hook
    (eww-mode . pg/eww-mode-setup))

#+end_src

*** Web design package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-web.el

  (provide 'pg-web)

#+end_src

** File management

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  ;;; pg-file.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Temporary Files Management and Symlinks

Some settings to manage where emacs stores backup files (such as the =~= backup files).

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory)))
        auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
        auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t))
        vc-follow-symlinks t)

#+end_src

*** Package | dired

The built-in directory editor. Some basic useful keybindings to keep in mind:
- ~j~ / ~k~ - Next / Previous line
- ~J~ - Jump to file in buffer
- ~RET~ - Select file or directory
- ~^~ - Go to parent directory
- ~g O~ - Open file in other window
- ~g o~ - Open file in other window in preview mode, which can be closed with ~q~
- ~M-RET~ - Show file in other window without focusing (previewing)

Keybindings relative to marking (selecting) in dired:
- ~m~ - Marks a file
- ~u~ - Unmarks a file
- ~U~ - Unmarks all files in buffer
- ~t~ - Inverts marked files in buffer
- ~% m~ - Mark files in buffer using regular expression
- ~*~ - Lots of other auto-marking functions
- ~K~ - "Kill" marked items, removed from the view only (refresh buffer with ~g r~ to get them back)
Many operations can be done on a single file if there are no active marks.

Keybindings relative to copying and renaming files:
- ~C~ - Copy marked files (or if no files are marked, the current file)
- ~R~ - Rename marked files
- ~% R~ - Rename based on regular expression

Keybindings relative to deleting files:
- ~D~ - Delete marked file
- ~d~ - Mark file for deletion
- ~x~ - Execute deletion for marks
- ~delete-by-moving-to-trash~ - Move to trash instead of deleting permanently if set to true

Keybindings relative to archives and compressing:
- ~Z~ - Compress or uncompress a file or folder to (.tar.gz)
- ~c~ - Compress selection to a specific file
- ~dired-compress-files-alist~ - Bind compression commands to file extension by adding additional extensions to the list

Keybindings for other useful operations:
- ~T~ - Touch (change timestamp)
- ~M~ - Change file mode
- ~O~ - Change file owner
- ~G~ - Change file group
- ~S~ - Create a symbolic link to this file
- ~L~ - Load an Emacs Lisp file into Emacs
  
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (use-package dired
    :straight nil
    :init
    (require 'dired)
    :after evil-collection
    :commands (dired dired-jump)
    :custom
    (dired-listing-switches "-agho --group-directories-first")
    :bind
    ("C-x C-j" . dired-jump)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer))

#+end_src

*** Package | dired-single

Keeps a single dired buffer open at a time (to not have multiple buried buffers).

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (use-package dired-single
    :straight t
    :init
    (require 'dired-single)
    :after dired)

#+end_src

*** Package | all-the-icons-dired

Displays icons in dired-mode.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (unless pg/is-termux
    (use-package all-the-icons-dired
      :straight t
      :init
      (require 'all-the-icons-dired)
      :hook
      (dired-mode . all-the-icons-dired-mode)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-all-the-icons-dired"

#+end_src

