Emacs.org
*** Package | dired-hide-dotfiles

Togglable option for hiding dot files.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (use-package dired-hide-dotfiles
    :straight t
    :init
    (require 'dired-hide-dotfiles)
    :after (dired evil-collection)
    :hook
    (dired-mode-hook . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map "H" 'dired-hide-dotfiles-mode))

#+end_src

*** Package | openwith

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (unless pg/is-termux
    (use-package openwith
      :disabled
      :straight t
    :init
    (require 'openwith)
      :custom
      (large-file-warning-threshold nil) 
      (openwith-associations `((,(openwith-make-extension-regexp '("mpg" "mpeg" "mp4" "avi" "wmv" "mov" "flv" "ogm" "ogg" "mkv"))
                                "mpv"
                                (file))
                               (,(openwith-make-extension-regexp '("odt"))
                                "libreoffice"
                                (file))))
      :config
      (openwith-mode 1)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-openwith"

#+end_src

*** File management package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (provide 'pg-file)

#+end_src

** Shell customization

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  ;;; pg-shell.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | eshell-git-prompt

Adds more detail to the prompt in eshell with custome themes.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  (use-package eshell-git-prompt
    :straight t
    :init
    (require 'eshell-git-prompt)
    :after eshell
    :config
    (eshell-git-prompt-use-theme 'multiline2))

#+end_src

*** Package | eshell-syntax-highlighting

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  (use-package eshell-syntax-highlighting
    :straight t
    :init
    (require 'eshell-syntax-highlighting)
    :after eshell
    :custom
    (eshell-syntax-highlighting-global-mode t))

#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-eshell-syntax-highlighting"

#+end_src

*** Package | esh-autosuggest

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  (defun pg/esh-autosuggest-setup ()
    "Eshell autosuggest setup."
    (require 'company)
    (set-face-foreground 'company-preview-common nil)
    (set-face-background 'company-preview nil))

  (use-package esh-autosuggest
    :straight t
    :init
    (require 'esh-autosuggest)
    :after eshell
    :hook
    (eshell-mode . esh-autosuggest-mode)
    :custom
    (esh-autosuggest-delay 0.5)
    :config
    (pg/esh-autosuggest-setup))

#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-esh-autosuggest"

#+end_src

*** Package | eshell

Some configurations to the built-in eshell.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  (defun pg/configure-eshell ()
    "Eshell setup."
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook #'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Bind some useful keys for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (corfu-mode)

    (setq eshell-history-size 10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell
    :straight nil
    :init 
    (require 'eshell)
    (require 'em-tramp)
    :hook
    (eshell-first-time-mode . pg/configure-eshell)
    :custom
    (eshell-prefer-lisp-functions t))

#+end_src

*** Package | vterm

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  (use-package vterm
    :straight nil
    :init
    (require 'vterm))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-vterm"

#+end_src

*** Shell customization package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  (provide 'pg-shell)

#+end_src

** Project Management and Version Control

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-project.el

  ;;; pg-project.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | projectile

Allows for git projects management. Accessed using the ~C-c p~ prefix. Some important notes:
- ~C-c p E~ - Allows creation of a local dirs dot file for pre-defining the values for some important other projectile variables.
  - If variables have not been set after this change then evaluate (~M-:~) the following function ~(hack-dir-local-variables)~.
- ~C-c p s r~ - Allows for use of the ~ripgrep~ command across the current reopository. Useful along with ~C-c C-o~ to pop out the results from the minibuffer into another buffer.
Note that the emacs built-in local dir creation can also be used and is more flexible.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-project.el

  (use-package projectile
    :straight t
    :init
    (require 'projectile)
    :after diminish
    :diminish projectile-mode
    :hook
    (lsp-mode . projectile-mode)
    :custom
    (projectile-switch-project-action #'projectile-dired)
    :bind
    (:map projectile-mode-map
	  ("C-c p" . projectile-command-map))
    :config
    (when (file-directory-p "~/Projects")
      (customize-set-variable 'projectile-project-search-path '("~/Projects"))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-projectile" ;; old version 2.5.0

#+end_src

*** Package | magit

Allows for git commands to be applied to the current repository using the command ~C-x g~ which invokes a ~git status~ command with some additional information. Typing ~?~ invokes a list of possible commands, typing ~?~ again invokes the help function for the different commands and typing ~?~ a third time invokes the manual for the package.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-project.el

  (use-package magit
    :straight t
    :init
    (require 'magit)
    :commands (magit-status magit-get-current-branch)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-magit"

#+end_src

*** Package | git-gutter

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-project.el

  (use-package git-gutter
    :straight t
    :init
    (require 'git-gutter)
    :after diminish
    :diminish git-gutter-mode
    :hook
    ((text-mode-hook
      prog-mode-hook) . git-gutter-mode)
    :config
    (set-face-foreground 'git-gutter:added "LightGreen")
    (set-face-foreground 'git-gutter:modified "LightGoldenrod")
    (set-face-foreground 'git-gutter:deleted "LightCoral"))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-git-gutter"
  ;; "emacs-git-gutter-fringe"

#+end_src

*** Package | forge

Adds git forges to magit.
Steps to get working:
- Run ~forge-pull~ at the current git repo

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-project.el

  (use-package forge
    :straight t
    :init
    (require 'forge)
    :after magit
    :custom
    (forge-add-default-bindings nil))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-forge"

#+end_src

*** Project management and version control package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-project.el

  (provide 'pg-project)

#+end_src

** IDE Functionalities 

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  ;;; pg-programming.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | lsp-mode

Language Server Protocol for basic IDE functionalities. See [[https://emacs-lsp.github.io/lsp-mode/page/languages/][here]] for how to setup for different languages.
The ~lsp-ui-doc-focus-frame~ command allows to access the documentation frame of the pop-up.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (defun pg/lsp-mode-setup ()
    "Displays structure of cursor position for all buffers."
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-lens-mode)
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :straight t
    :init
    (require 'lsp-mode)
    (require 'lsp-completion)
    :commands (lsp lsp-deferred)
    :hook
    (lsp-mode-hook . pg/lsp-mode-setup)
    :custom
    (lsp-completion-provider :none)
    (lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-lsp-mode"

#+end_src

*** Package | lsp-ui

Displays useful doc on hover.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (use-package lsp-ui
    :straight t
    :init
    (require 'lsp-ui)
    :after lsp-mode
    :hook
    (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom)
    (lsp-ui-doc-show-with-cursor t)
    (lsp-ui-doc-include-signature t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-lsp-ui"

#+end_src

*** Package | lsp-treemacs

Tree views in emacs.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (use-package lsp-treemacs
    :straight t
    :init
    (require 'lsp-treemacs)
    :after lsp)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-lsp-treemacs"

#+end_src

*** Package | company

For auto-completions while coding.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (defvar company-mode/enable-yas t
    "Enable yasnippet for all backends.")

  (defun company-mode/backend-with-yas (backend)
    "Configures company backend with yasnippet for autocomplete candidates."
    (if (or (not company-mode/enable-yas) (and (listp backend) (member 'company-yasnippet backend)))
        backend
      (append (if (consp backend) backend (list backend))
              '(:with company-yasnippet))))

  (use-package company
    :straight t
    :init
    (require 'company)
    :hook
    (prog-mode . company-mode)
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0)
    (company-tooltip-minimum-width 40)
    (company-tooltip-maximum-width 60)
    (company-backends (mapcar #'company-mode/backend-with-yas company-backends))
    :bind
    (:map company-active-map
          ("<tab>" . company-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-company"

#+end_src

*** Package | company-box

Includes icons for company mode suggestions.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (use-package company-box
    :straight t
    :init
    (require 'company-box)
    :after company
    :hook
    (company-mode . company-box-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-company-box"

#+end_src

*** Package | company-prescient

Remembers autocomplete selections.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (use-package company-prescient
    :straight t
    :init
    (require 'company-prescient)
    :after (company prescient)
    :custom
    (company-prescient-mode 1))

#+end_src

*** Package | flycheck

Syntax checking.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (use-package flycheck
    :straight t
    :init
    (require 'flycheck)
    :after lsp-mode
    :hook
    (lsp-mode-hook . flycheck-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-flycheck"

#+end_src

*** Package | dap-mode

Debugger Adaptor Protocol for IDE debugging commands. See [[https://emacs-lsp.github.io/dap-mode/page/configuration/][here]] for how to setup for different languages.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (use-package dap-mode
    :straight t
    :init
    (require 'dap-mode)
    :after lsp-mode
    :custom
    (dap-mode 1)
    (dap-ui-mode 1)
    (dap-ui-controls-mode 1))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-dap-mode"

#+end_src

*** Package | plantuml-mode

Allows writing textual descriptions for creating uml diagrams

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (use-package plantuml-mode
    :straight t
    :init
    (require 'plantuml-mode)
    :custom
    (plantuml-indent-level 4)
    (plantuml-jar-path "~/bin/plantuml.jar")
    (plantuml-default-exec-mode 'jar))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-plantuml-mode"

#+end_src

*** Package | comment-dwin-2

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (use-package comment-dwim-2
    :straight t
    :init
    (require 'comment-dwim-2)
    :bind
    ("M-/" . comment-dwim-2)
    (:map org-mode-map
          ("M-/" . org-comment-dwim-2)))

#+end_src

*** Package | yasnippet

Allows for code snippets for different languages.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (use-package yasnippet
    :straight t
    :init
    (require 'yasnippet)
    :after (company diminish)
    :diminish yas-minor-mode
    :hook
    (prog-mode . yas-minor-mode)
    (yas-minor-mode . (lambda ()
                        (yas-activate-extra-mode 'fundamental-mode)))
    :config
    (yas-global-mode 1))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-yasnippet"

#+end_src

*** Package | yasnippet-snippets

Collection of code snippets for yasnippet.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (use-package yasnippet-snippets
    :straight t
    :init
    (require 'yasnippet-snippets))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-yasnippet-snippets"

#+end_src

*** IDE functionalities package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (provide 'pg-programming)

#+end_src

