Emacs.org
*** Languages

Some general tools for programming:

*Guix Packages*

#+begin_src scheme :tangle ~/.config/guix/manifests/build-tools.scm

  (specifications->manifest
   '("meson"
     "ninja"
     "autoconf"
     "automake"
     "libtool"
     "gmime"
     "xapian"
     "docker"
     ;; "gtk+"
     ;; "gtk+:bin"
     ;; "webkitgtk"
     ;; "guile"
     "pkg-config"
     "glibc"
     "glib"
     "glib:bin"
     ;; "check"
     "make"
     "cmake"))

#+end_src

**** Alloy

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-alloy.el

  ;;; pg-programming-alloy.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | alloy-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-alloy.el

  (use-package alloy-mode
    :disabled
    :straight t
    :init
    (require 'alloy-mode)
    :hook
    (alloy-mode . (lambda ()
                    (setq indent-tabs-mode nil)))
    :custom
    (alloy-basic-offset 4))

#+end_src

***** Alloy package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-alloy.el

  (provide 'pg-programming-alloy)

#+end_src

**** C/C++/Objective-C

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-cc.el

  ;;; pg-programming-cc.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | cc-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-cc.el

  (use-package cc-mode
    :straight nil
    :init
    (require 'cc-mode)
    :hook
    ((c-mode
      c++-mode
      objc-mode) . lsp-deferred)
    :custom
    (company-clang-executable (expand-file-name "~/.guix-extra-profiles/cc/cc/bin/clang")))

#+end_src

*Guix Packages*

#+begin_src scheme :tangle ~/.config/guix/manifests/cc.scm

  (specifications->manifest
   '("gcc-toolchain@10.3.0"
     "texinfo"
     "llvm"
     "clang"
     "ccls"
     "lld"
     "file"
     "elfutils"
     "go"))

#+end_src

***** Package | cc-vars

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-cc.el

  (use-package cc-vars
    :straight nil
    :init
    (require 'cc-vars)
    :after cc-mode
    :custom
    (c-basic-offset 4))

#+end_src
***** Package | company-c-headers

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-cc.el

  (use-package company-c-headers
    :straight t
    :init
    (require 'company-c-headers)
    :after (cc-mode company)
    :config
    (add-to-list 'company-backends '(company-c-headers :with company-yasnippet)))

#+end_src

***** Package | ccls

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-cc.el

  (use-package ccls
    :straight t
    :init
    (require 'ccls)
    :after (cc-mode lsp-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-ccls"

#+end_src

***** C languages package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-cc.el

  (provide 'pg-programming-cc)

#+end_src

**** Common Lisp

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-commonlisp.el

  ;;; pg-programming-commonlisp.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | sly

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-commonlisp.el

  (use-package sly
    :straight t
    :init
    (require 'sly)
    :after lisp-mode
    :custom
    (inferior-lisp-program "sbcl"))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-sly"

#+end_src

***** Common lisp package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-commonlisp.el

  (provide 'pg-programming-commonlisp)

#+end_src

**** Css/LessCSS/SASS/SCSS

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-css.el

  ;;; pg-programming-css.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | lsp-css

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-css.el

  (use-package lsp-css
    :straight nil
    :init
    (require 'lsp-css)
    :after lsp-mode
    :hook
    ((css-mode
      less-css-mode
      scss-mode) . lsp-deferred))

#+end_src

***** Css package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-css.el

  (provide 'pg-programming-css)

#+end_src

**** Docker

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-docker.el

  ;;; pg-programming-docker.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | docker

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-docker.el

  (use-package docker
    :straight t
    :init
    (require 'docker))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-docker"

#+end_src

***** Package | dockerfile-mode
     
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-docker.el

  (use-package dockerfile-mode
    :straight t
    :init
    (require 'dockerfile-mode)
    :after docker)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-dockerfile-mode"

#+end_src

***** Docker package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-docker.el

  (provide 'pg-programming-docker)

#+end_src

**** Git

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-git.el

  ;;; pg-programming-git.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | git-modes

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-git.el

  (use-package git-modes
    :straight t
    :init
    (require 'git-modes))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-git-modes"

#+end_src

***** Git package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-git.el

  (provide 'pg-programming-git)

#+end_src

**** Groovy

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-groovy.el

  ;;; pg-programming-groovy.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | groovy-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-groovy.el

  (use-package groovy-mode
    :straight '(groovy-emacs-modes :type git
                                   :host github
                                   :repo "Groovy-Emacs-Modes/groovy-emacs-modes")
    :init
    (require 'groovy-mode))

#+end_src

***** Groovy package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-groovy.el

  (provide 'pg-programming-groovy)

#+end_src

**** Haskell

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-haskell.el

  ;;; pg-programming-haskell.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | haskell-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-haskell.el

  (use-package haskell-mode
    :straight t
    :init
    (require 'haskell-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :tangle ~/.config/guix/manifests/haskell.scm

  (specifications->manifest
   '("ghc@8"))

#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-haskell-mode"

#+end_src

***** Package | lsp-haskell

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-haskell.el

  (use-package lsp-haskell
    :disabled
    :straight t
    :init
    (require 'lsp-haskell)
    :after lsp-mode
    :hook
    ((haskell-mode
      haskell-literate-mode) . lsp-deferred))

#+end_src

***** Haskell package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-haskell.el

  (provide 'pg-programming-haskell)

#+end_src

**** Java

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-java.el

  ;;; pg-programming-java.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | lsp-java

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-java.el

  (defun pg/spring-boot-properties ()
    "Makes appropriate calls when opening a spring properties file."
    (when (not (equal nil (string-match-p "application\\(-?[^-]+\\)?\\.properties"
                                          (file-name-nondirectory (buffer-file-name)))))
      (progn (run-hooks 'prog-mode-hook)
             (lsp-deferred))))

  (use-package lsp-java
    :straight t
    :init
    (require 'lsp-java)
    (dolist (feature '(dap-java
                       lsp-java-boot))
      (require feature))
    :hook
    (java-mode . (lsp-deferred lsp-java-boot-lens-mode))
    (find-file . pg/spring-boot-properties)
    :custom
    (lsp-java-configuration-runtimes '[( :name "JavaSE-17"
                                         :path (expand-file-name "~/.guix-extra-profiles/java/java")
                                         :default t)])
    (lsp-java-vmargs (list "-noverify" "--enable-preview"))
    (lsp-java-java-path "java")
    (lsp-java-import-gradle-java-home (expand-file-name "~/.guix-extra-profiles/java/java"))
    :bind
    (:map lsp-mode-map
          ("C-<return>" . lsp-execute-code-action)))

#+end_src

*Guix Packages*

#+begin_src scheme :tangle ~/.config/guix/manifests/java.scm

  (specifications->manifest
   '("openjdk@17:jdk"
     "openjdk@17:doc"
     "maven"))

#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-lsp-java"

#+end_src

***** Java package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-java.el

  (provide 'pg-programming-java)

#+end_src

**** LaTeX

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-tex.el

  ;;; pg-programming-tex.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | tex

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-tex.el

  (use-package tex
    :straight auctex
    :init
    (require 'tex)
    :mode ("\\.tex$" . latex-mode)
    :hook
    (TeX-mode-hook . (lambda ()
                       (run-hooks 'prog-mode-hook)))
    :custom
    (latex-run-command "pdflatex")
    (TeX-view-program-selection '((output-pdf "PDF Tools")))
    (TeX-source-correlate-start-server t)
    :config
    (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
    (put 'tex-mode 'derived-mode-parent 'prog-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :tangle ~/.config/guix/manifests/latex.scm

  (specifications->manifest
   '("rubber"
     "texlive"))

#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-auctex"

#+end_src

***** Package | company-auctex

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-tex.el

  (use-package company-auctex
    :straight t
    :init
    (require 'company-auctex)
    :after (company auctex)
    :config
    (add-to-list 'company-backends '(company-auctex :with company-yasnippet)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-company-auctex"

#+end_src

***** LaTeX package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-tex.el

  (provide 'pg-programming-tex)

#+end_src

**** LMC

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-lmc.el

  ;;; pg-programming-lmc.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | lmc-java

Custom syntax highlighting for LMC assembly language.
      
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-lmc.el

  (defvar lmc-java-mode-hook nil)

  ;; (add-to-list 'auto-mode-alist '("\\.lmc\\'" . lmc-java-mode))

  (defconst lmc-java-font-lock-defaults
    (list
     '("#.*" . font-lock-comment-face)
     '("\\<\\(ADD\\|BR[PZ]?\\|DAT\\|HLT\\|IN\\|LDA\\|OUT\\|S\\(?:TO\\|UB\\)\\)\\>" . font-lock-keyword-face)
     '("^\\w+" . font-lock-function-name-face)
     '("\\b[0-9]+\\b" . font-lock-constant-face))
    "Minimal highlighting expressions for lmc mode")

  (defvar lmc-java-mode-syntax-table
    (let ((st (make-syntax-table)))
      (modify-syntax-entry ?# ". 1b" st)
      (modify-syntax-entry ?\n "> b" st)
      st)
    "Syntax table for lmc-mode")

  (define-derived-mode lmc-java-mode prog-mode "LMC"
    "Major mode for editing lmc files"
    :syntax-table lmc-mode-syntax-table

    (set (make-local-variable 'font-lock-defaults) '(lmc-font-lock-defaults))

    (setq-local comment-start "# "
                comment-end ""
                indent-tabs-mode nil))

#+end_src

***** Package | lmc

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-lmc.el

  (define-derived-mode pg/lmc-asm-mode prog-mode "LMC-Asm"
    "Major mode to edit LMC assembly code."
    :syntax-table emacs-lisp-mode-syntax-table
    (set (make-local-variable 'font-lock-defaults)
         '(lmc-asm-font-lock-keywords))
    (set (make-local-variable 'indent-line-function)
         #'lmc-asm-indent-line)
    (set (make-local-variable 'indent-tabs-mode) nil)
    (set (make-local-variable 'imenu-generic-expression)
         lmc-asm-imenu-generic-expression)
    (set (make-local-variable 'outline-regexp) lmc-asm-outline-regexp)
    (add-hook 'completion-at-point-functions #'lmc-asm-completion nil t)
    (set (make-local-variable 'comment-start) "#")
    (set (make-local-variable 'comment-start-skip)
         "\\(\\(^\\|[^\\\\\n]\\)\\(\\\\\\\\\\)*\\)#+ *"))

  (use-package lmc
    :straight t
    :init
    (require 'lmc)
    :init
    (fset #'lmc-asm-mode #'pg/lmc-asm-mode))

#+end_src

***** Lmc package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-lmc.el

  (provide 'pg-programming-lmc)

#+end_src

**** Markdown

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-markdown.el

  ;;; pg-programming-markdown.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | markdown-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-markdown.el

  (use-package markdown-mode
    :straight t
    :init
    (require 'markdown-mode)
    :hook
    (gfm-view-mode . (lambda ()
                       (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                                          (markdown-code-face (:height 1.5) fixed-pitch))))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-markdown-mode"

#+end_src

***** Markdown package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-markdown.el

  (provide 'pg-programming-markdown)

#+end_src

**** MIPS

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-mips.el

  ;;; pg-programming-mips.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | mips-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-mips.el

  (use-package mips-mode
    :straight t
    :init
    (require 'mips-mode)
    :mode "\\.asm$"
    :custom
    (mips-tab-width 4))

#+end_src

***** Mips package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-mips.el

  (provide 'pg-programming-mips)

#+end_src

**** Python

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-python.el

  ;;; pg-programming-python.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

