Emacs.org
***** Package | lsp-python-ms

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-python.el

  (use-package lsp-python-ms
    :straight t
    :init
    (require 'lsp-python-ms)
    :after (python lsp-mode)
    :hook
    (python-mode . lsp-deferred)
    :custom
    (lsp-python-ms-auto-install-server t))

#+end_src

***** Package | dap-python

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-python.el

  (use-package dap-python
    :straight nil
    :init
    (require 'dap-python)
    :after (python lsp-mode)
    :custom
    (dap-python-debugger 'debugpy))

#+end_src

*Guix Packages*

#+begin_src scheme :tangle ~/.config/guix/manifests/python.scm

    (specifications->manifest
     '("python"))

#+end_src

***** TODO Package | jupyter

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-python.el

  (use-package jupyter
    :disabled
    :straight t
    :init
    (require 'jupyter))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-jupyter"

#+end_src

***** Python package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-python.el

  (provide 'pg-programming-python)

#+end_src

**** SMTLibv2

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-smtlibv2.el

  ;;; pg-programming-smtlibv2.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** HOLD Package | z3-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-smtlibv2.el

  (use-package z3-mode
    :disabled
    :straight t
    :init
    (require 'z3-mode))

#+end_src

***** SMTLibv2 package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-smtlibv2.el

  (provide 'pg-programming-smtlibv2)

#+end_src

**** SQL

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-sql.el

  ;;; pg-programming-sql.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | sql

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-sql.el

  (use-package sql
    :straight nil
    :init
    (require 'sql)
    :hook
    (sql-interactive-mode . (lambda ()
                              (toggle-truncate-lines t)))
    :custom
    (sql-connection-alist '((main (sql-product 'postgres)
                                  (sql-port 5432)
                                  (sql-server "localhost")
                                  (sql-user "phil-gab99")
                                  (sql-password (pg/lookup-password :host "localhost" :user "phil-gab99" :port 5432))
                                  (sql-database "phil-gab99"))
                            (school (sql-product 'postgres)
                                    (sql-port 5432)
                                    (sql-server "localhost")
                                    (sql-user "phil-gab99")
                                    (sql-password (pg/lookup-password :host "localhost" :user "phil-gab99" :port 5432))
                                    (sql-database "ift2935")))))

#+end_src


*Guix Packages*

#+begin_src scheme :tangle ~/.config/guix/manifests/sql.scm

  (specifications->manifest
   '("postgresql@14.2"
     "sqls"))

#+end_src

***** Package | lsp-sql

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-sql.el

  (use-package lsp-sqls
    :straight nil
    :after (sql lsp-mode)
    :hook
    (sql-mode . lsp-deferred)
    :custom
    (lsp-sqls-connections
     `(,(cl-pairlis '(driver dataSourceName)
                    `(("postgresql") ,(concat "host=127.0.0.1 port=5432 user=phil-gab99 password="
                                              (pg/lookup-password :host "localhost" :user "phil-gab99" :port 5432)
                                              " dbname=phil-gab99 sslmode=disable")))
       ,(cl-pairlis '(driver dataSourceName)
                    `(("postgresql") ,(concat "host=127.0.0.1 port=5432 user=phil-gab99 password="
                                              (pg/lookup-password :host "localhost" :user "phil-gab99" :port 5432)
                                              " dbname=ift2935 sslmode=disable"))))))

#+end_src

***** Package | sql-indent

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-sql.el

  (use-package sql-indent
    :straight t
    :init
    (require 'sql-indent)
    :after sql
    :hook
    (sql-mode . sqlind-minor-mode)
    :config
    (setq-default sqlind-basic-offset 4))

#+end_src

***** SQL package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-sql.el

  (provide 'pg-programming-sql)

#+end_src

**** TypeScript

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-typescript.el

  ;;; pg-programming-typescript.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | typescript-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-typescript.el

  (use-package typescript-mode
    :straight t
    :init
    (require 'typescript-mode)
    :mode "\\.ts$")

#+end_src



*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-typescript-mode"

#+end_src

***** Package | dap-node

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-typescript.el

  (use-package dap-node
    :straight nil
    :after (typescript-mode lsp-mode)
    :hook
    (typescript-mode . lsp-deferred)
    :config
    (dap-node-setup))

#+end_src

***** Typescript package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-typescript.el

  (provide 'pg-programming-typescript)

#+end_src

**** VHDL

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-vhdl.el

  ;;; pg-programming-vhdl.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** TODO Package | vhdl-tools

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-vhdl.el

  (flycheck-define-checker vhdl-tool
    "A VHDL syntax checker, type checker and linter using VHDL-Tool."
    :command ("vhdl-tool" "client" "lint" "--compact" "--stdin" "-f" source)
    :standard-input t
    :modes (vhdl-mode)
    :error-patterns
    ((warning line-start (file-name) ":" line ":" column ":w:" (message) line-end)
     (error line-start (file-name) ":" line ":" column ":e:" (message) line-end)))

  (use-package vhdl-tools
    :disabled
    :straight t
    :init
    (require 'vhdl-tools)
    :after flycheck
    :hook
    (vhdl-mode . lsp-deferred)
    :config
    (add-to-list 'flycheck-checkers 'vhdl-tool)
    :custom
    (lsp-vhdl-server-path "~/.emacs.d/lsp-servers/vhdl-tool"))

#+end_src

***** VHDL package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-vhdl.el

  (provide 'pg-programming-vhdl)

#+end_src

**** YAML

***** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-yaml.el

  ;;; pg-programming-yaml.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

***** Package | yaml-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-yaml.el

  (use-package yaml-mode
    :straight t
    :init
    (require 'yaml-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-yaml-mode"

#+end_src

***** YAML package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-yaml.el

  (provide 'pg-programming-yaml)

#+end_src

** Notification

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-notification.el

  ;;; pg-notification.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

*** Package | alert

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-notification.el

  (use-package alert
    :straight t
    :init
    (require 'alert)
    :custom
    (alert-default-style 'notifications))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-alert"

#+end_src

*** Notification package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-notification.el

  (provide 'pg-notification)

#+end_src

** Org Mode

*** Package header

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  ;;; pg-org.el -*- lexical-binding: t; -*-
  ;; Author: Philippe Gabriel

#+end_src

